MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA704/mcu.h
/* CRCXORH */
#define _X16 CRCXORHbits.X16
#define _X17 CRCXORHbits.X17
#define _X18 CRCXORHbits.X18
#define _X19 CRCXORHbits.X19
#define _X20 CRCXORHbits.X20
#define _X21 CRCXORHbits.X21
#define _X22 CRCXORHbits.X22
#define _X23 CRCXORHbits.X23
#define _X24 CRCXORHbits.X24
#define _X25 CRCXORHbits.X25
#define _X26 CRCXORHbits.X26
#define _X27 CRCXORHbits.X27
#define _X28 CRCXORHbits.X28
#define _X29 CRCXORHbits.X29
#define _X30 CRCXORHbits.X30
#define _X31 CRCXORHbits.X31

/* REFOCON1 */
#define _ROSEL REFOCON1bits.ROSEL
#define _ROACTIVE REFOCON1bits.ROACTIVE
#define _ROSWEN REFOCON1bits.ROSWEN
#define _ROSLP REFOCON1bits.ROSLP
#define _ROOUT REFOCON1bits.ROOUT
#define _ROSIDL REFOCON1bits.ROSIDL
#define _ROEN REFOCON1bits.ROEN
#define _ROSEL0 REFOCON1bits.ROSEL0
#define _ROSEL1 REFOCON1bits.ROSEL1
#define _ROSEL2 REFOCON1bits.ROSEL2
#define _ROSEL3 REFOCON1bits.ROSEL3

/* REFOCON2 */
#define _RODIV REFOCON2bits.RODIV
#define _RODIV0 REFOCON2bits.RODIV0
#define _RODIV1 REFOCON2bits.RODIV1
#define _RODIV2 REFOCON2bits.RODIV2
#define _RODIV3 REFOCON2bits.RODIV3
#define _RODIV4 REFOCON2bits.RODIV4
#define _RODIV5 REFOCON2bits.RODIV5
#define _RODIV6 REFOCON2bits.RODIV6
#define _RODIV7 REFOCON2bits.RODIV7
#define _RODIV8 REFOCON2bits.RODIV8
#define _RODIV9 REFOCON2bits.RODIV9
#define _RODIV10 REFOCON2bits.RODIV10
#define _RODIV11 REFOCON2bits.RODIV11
#define _RODIV12 REFOCON2bits.RODIV12
#define _RODIV13 REFOCON2bits.RODIV13
#define _RODIV14 REFOCON2bits.RODIV14

/* PMD1 */
#define _AD1MD PMD1bits.AD1MD
#define _SPI1MD PMD1bits.SPI1MD
#define _SPI2MD PMD1bits.SPI2MD
#define _U1MD PMD1bits.U1MD
#define _U2MD PMD1bits.U2MD
#define _I2C1MD PMD1bits.I2C1MD
#define _T1MD PMD1bits.T1MD
#define _T2MD PMD1bits.T2MD
#define _T3MD PMD1bits.T3MD

/* PMD2 */
#define _OC1MD PMD2bits.OC1MD
#define _OC2MD PMD2bits.OC2MD
#define _OC3MD PMD2bits.OC3MD
#define _IC1MD PMD2bits.IC1MD
#define _IC2MD PMD2bits.IC2MD
#define _IC3MD PMD2bits.IC3MD

/* PMD3 */
#define _I2C2MD PMD3bits.I2C2MD
#define _CRCMD PMD3bits.CRCMD
#define _PMPMD PMD3bits.PMPMD
#define _RTCCMD PMD3bits.RTCCMD
#define _CMPMD PMD3bits.CMPMD

/* PMD4 */
#define _LVDMD PMD4bits.LVDMD
#define _CTMUMD PMD4bits.CTMUMD
#define _REFOMD PMD4bits.REFOMD

/* PMD5 */
#define _CCP1MD PMD5bits.CCP1MD
#define _CCP2MD PMD5bits.CCP2MD
#define _CCP3MD PMD5bits.CCP3MD
#define _CCP4MD PMD5bits.CCP4MD
#define _CCP5MD PMD5bits.CCP5MD

/* PMD6 */
#define _SPI3MD PMD6bits.SPI3MD

/* PMD7 */
#define _DMA0MD PMD7bits.DMA0MD
#define _DMA1MD PMD7bits.DMA1MD

/* PMD8 */
#define _CLC1MD PMD8bits.CLC1MD
#define _CLC2MD PMD8bits.CLC2MD

/* T1CON */
#define _TCS T1CONbits.TCS
#define _TSYNC T1CONbits.TSYNC
#define _TCKPS T1CONbits.TCKPS
#define _TGATE T1CONbits.TGATE
#define _TECS T1CONbits.TECS
#define _TSIDL T1CONbits.TSIDL
#define _TON T1CONbits.TON
#define _TCKPS0 T1CONbits.TCKPS0
#define _TCKPS1 T1CONbits.TCKPS1
#define _T1ECS0 T1CONbits.T1ECS0
#define _T1ECS1 T1CONbits.T1ECS1
#define _T1ECS T1CONbits.T1ECS
#define _TECS0 T1CONbits.TECS0
#define _TECS1 T1CONbits.TECS1
#define _TIECS T1CONbits.TIECS
#define _TIECS0 T1CONbits.TIECS0
#define _TIECS1 T1CONbits.TIECS1

/* T2CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _T32 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TECS cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _TECS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TECS1 cannot be defined because it is used by more than one SFR */
/* Bitname _TIECS cannot be defined because it is used by more than one SFR */
/* Bitname _TIECS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TIECS1 cannot be defined because it is used by more than one SFR */
#define _T45 T2CONbits.T45

/* T3CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TECS cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _TECS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TECS1 cannot be defined because it is used by more than one SFR */
/* Bitname _TIECS cannot be defined because it is used by more than one SFR */
/* Bitname _TIECS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TIECS1 cannot be defined because it is used by more than one SFR */

/* CTMUCON1L */
#define _IRNG CTMUCON1Lbits.IRNG
#define _ITRIM CTMUCON1Lbits.ITRIM
#define _CTTRIG CTMUCON1Lbits.CTTRIG
#define _IDISSEN CTMUCON1Lbits.IDISSEN
#define _EDGSEQEN CTMUCON1Lbits.EDGSEQEN
#define _EDGEN CTMUCON1Lbits.EDGEN
#define _TGEN CTMUCON1Lbits.TGEN
#define _CTMUSIDL CTMUCON1Lbits.CTMUSIDL
#define _CTMUEN CTMUCON1Lbits.CTMUEN
#define _IRNG0 CTMUCON1Lbits.IRNG0
#define _IRNG1 CTMUCON1Lbits.IRNG1
#define _ITRIM0 CTMUCON1Lbits.ITRIM0
#define _ITRIM1 CTMUCON1Lbits.ITRIM1
#define _ITRIM2 CTMUCON1Lbits.ITRIM2
#define _ITRIM3 CTMUCON1Lbits.ITRIM3
#define _ITRIM4 CTMUCON1Lbits.ITRIM4
#define _ITRIM5 CTMUCON1Lbits.ITRIM5

/* CTMUCON1H */
#define _IRNGH CTMUCON1Hbits.IRNGH
#define _EDG2SEL CTMUCON1Hbits.EDG2SEL
#define _EDG2POL CTMUCON1Hbits.EDG2POL
#define _EDG2MOD CTMUCON1Hbits.EDG2MOD
#define _EDG1STAT CTMUCON1Hbits.EDG1STAT
#define _EDG2STAT CTMUCON1Hbits.EDG2STAT
#define _EDG1SEL CTMUCON1Hbits.EDG1SEL
#define _EDG1POL CTMUCON1Hbits.EDG1POL
#define _EDG1MOD CTMUCON1Hbits.EDG1MOD
#define _EDG2SEL0 CTMUCON1Hbits.EDG2SEL0
#define _EDG2SEL1 CTMUCON1Hbits.EDG2SEL1
#define _EDG2SEL2 CTMUCON1Hbits.EDG2SEL2
#define _EDG2SEL3 CTMUCON1Hbits.EDG2SEL3
#define _EDG1SEL0 CTMUCON1Hbits.EDG1SEL0
#define _EDG1SEL1 CTMUCON1Hbits.EDG1SEL1
#define _EDG1SEL2 CTMUCON1Hbits.EDG1SEL2
#define _EDG1SEL3 CTMUCON1Hbits.EDG1SEL3

/* CTMUCON2L */
#define _DSCHS CTMUCON2Lbits.DSCHS
#define _IRSTEN CTMUCON2Lbits.IRSTEN
#define _DSCHS0 CTMUCON2Lbits.DSCHS0
#define _DSCHS1 CTMUCON2Lbits.DSCHS1
#define _DSCHS2 CTMUCON2Lbits.DSCHS2

/* RTCCON1L */
#define _TSAEN RTCCON1Lbits.TSAEN
#define _OUTSEL RTCCON1Lbits.OUTSEL
#define _RTCOE RTCCON1Lbits.RTCOE
#define _PWCPOE RTCCON1Lbits.PWCPOE
#define _PWCPOL RTCCON1Lbits.PWCPOL
#define _PWCEN RTCCON1Lbits.PWCEN
#define _WRLOCK RTCCON1Lbits.WRLOCK
#define _RTCEN RTCCON1Lbits.RTCEN

