MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA704/mcu.h
#define _CCP3CON3H_PSSACE_POSITION               0x00000002
#define _CCP3CON3H_PSSACE_MASK                   0x0000000C
#define _CCP3CON3H_PSSACE_LENGTH                 0x00000002

#define _CCP3CON3H_POLBDF_POSITION               0x00000004
#define _CCP3CON3H_POLBDF_MASK                   0x00000010
#define _CCP3CON3H_POLBDF_LENGTH                 0x00000001

#define _CCP3CON3H_POLACE_POSITION               0x00000005
#define _CCP3CON3H_POLACE_MASK                   0x00000020
#define _CCP3CON3H_POLACE_LENGTH                 0x00000001

#define _CCP3CON3H_OUTM_POSITION                 0x00000008
#define _CCP3CON3H_OUTM_MASK                     0x00000700
#define _CCP3CON3H_OUTM_LENGTH                   0x00000003

#define _CCP3CON3H_OSCNT_POSITION                0x0000000C
#define _CCP3CON3H_OSCNT_MASK                    0x00007000
#define _CCP3CON3H_OSCNT_LENGTH                  0x00000003

#define _CCP3CON3H_OETRIG_POSITION               0x0000000F
#define _CCP3CON3H_OETRIG_MASK                   0x00008000
#define _CCP3CON3H_OETRIG_LENGTH                 0x00000001

#define _CCP3CON3H_PSSBDF0_POSITION              0x00000000
#define _CCP3CON3H_PSSBDF0_MASK                  0x00000001
#define _CCP3CON3H_PSSBDF0_LENGTH                0x00000001

#define _CCP3CON3H_PSSBDF1_POSITION              0x00000001
#define _CCP3CON3H_PSSBDF1_MASK                  0x00000002
#define _CCP3CON3H_PSSBDF1_LENGTH                0x00000001

#define _CCP3CON3H_PSSACE0_POSITION              0x00000002
#define _CCP3CON3H_PSSACE0_MASK                  0x00000004
#define _CCP3CON3H_PSSACE0_LENGTH                0x00000001

#define _CCP3CON3H_PSSACE1_POSITION              0x00000003
#define _CCP3CON3H_PSSACE1_MASK                  0x00000008
#define _CCP3CON3H_PSSACE1_LENGTH                0x00000001

#define _CCP3CON3H_OUTM0_POSITION                0x00000008
#define _CCP3CON3H_OUTM0_MASK                    0x00000100
#define _CCP3CON3H_OUTM0_LENGTH                  0x00000001

#define _CCP3CON3H_OUTM1_POSITION                0x00000009
#define _CCP3CON3H_OUTM1_MASK                    0x00000200
#define _CCP3CON3H_OUTM1_LENGTH                  0x00000001

#define _CCP3CON3H_OUTM2_POSITION                0x0000000A
#define _CCP3CON3H_OUTM2_MASK                    0x00000400
#define _CCP3CON3H_OUTM2_LENGTH                  0x00000001

#define _CCP3CON3H_OSCNT0_POSITION               0x0000000C
#define _CCP3CON3H_OSCNT0_MASK                   0x00001000
#define _CCP3CON3H_OSCNT0_LENGTH                 0x00000001

#define _CCP3CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP3CON3H_OSCNT1_MASK                   0x00002000
#define _CCP3CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP3CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP3CON3H_OSCNT2_MASK                   0x00004000
#define _CCP3CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP3STAT_ICBNE_POSITION                 0x00000000
#define _CCP3STAT_ICBNE_MASK                     0x00000001
#define _CCP3STAT_ICBNE_LENGTH                   0x00000001

#define _CCP3STAT_ICOV_POSITION                  0x00000001
#define _CCP3STAT_ICOV_MASK                      0x00000002
#define _CCP3STAT_ICOV_LENGTH                    0x00000001

#define _CCP3STAT_ICDIS_POSITION                 0x00000002
#define _CCP3STAT_ICDIS_MASK                     0x00000004
#define _CCP3STAT_ICDIS_LENGTH                   0x00000001

#define _CCP3STAT_SCEVT_POSITION                 0x00000003
#define _CCP3STAT_SCEVT_MASK                     0x00000008
#define _CCP3STAT_SCEVT_LENGTH                   0x00000001

#define _CCP3STAT_ASEVT_POSITION                 0x00000004
#define _CCP3STAT_ASEVT_MASK                     0x00000010
#define _CCP3STAT_ASEVT_LENGTH                   0x00000001

#define _CCP3STAT_TRCLR_POSITION                 0x00000005
#define _CCP3STAT_TRCLR_MASK                     0x00000020
#define _CCP3STAT_TRCLR_LENGTH                   0x00000001

#define _CCP3STAT_TRSET_POSITION                 0x00000006
#define _CCP3STAT_TRSET_MASK                     0x00000040
#define _CCP3STAT_TRSET_LENGTH                   0x00000001

#define _CCP3STAT_CCPTRIG_POSITION               0x00000007
#define _CCP3STAT_CCPTRIG_MASK                   0x00000080
#define _CCP3STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP3STAT_ICGARM_POSITION                0x0000000A
#define _CCP3STAT_ICGARM_MASK                    0x00000400
#define _CCP3STAT_ICGARM_LENGTH                  0x00000001

#define _CCP3STAT_TRIG_POSITION                  0x00000007
#define _CCP3STAT_TRIG_MASK                      0x00000080
#define _CCP3STAT_TRIG_LENGTH                    0x00000001

#define _CCP3STATL_ICBNE_POSITION                0x00000000
#define _CCP3STATL_ICBNE_MASK                    0x00000001
#define _CCP3STATL_ICBNE_LENGTH                  0x00000001

#define _CCP3STATL_ICOV_POSITION                 0x00000001
#define _CCP3STATL_ICOV_MASK                     0x00000002
#define _CCP3STATL_ICOV_LENGTH                   0x00000001

#define _CCP3STATL_ICDIS_POSITION                0x00000002
#define _CCP3STATL_ICDIS_MASK                    0x00000004
#define _CCP3STATL_ICDIS_LENGTH                  0x00000001

#define _CCP3STATL_SCEVT_POSITION                0x00000003
#define _CCP3STATL_SCEVT_MASK                    0x00000008
#define _CCP3STATL_SCEVT_LENGTH                  0x00000001

#define _CCP3STATL_ASEVT_POSITION                0x00000004
#define _CCP3STATL_ASEVT_MASK                    0x00000010
#define _CCP3STATL_ASEVT_LENGTH                  0x00000001

#define _CCP3STATL_TRCLR_POSITION                0x00000005
#define _CCP3STATL_TRCLR_MASK                    0x00000020
#define _CCP3STATL_TRCLR_LENGTH                  0x00000001

#define _CCP3STATL_TRSET_POSITION                0x00000006
#define _CCP3STATL_TRSET_MASK                    0x00000040
#define _CCP3STATL_TRSET_LENGTH                  0x00000001

#define _CCP3STATL_CCPTRIG_POSITION              0x00000007
#define _CCP3STATL_CCPTRIG_MASK                  0x00000080
#define _CCP3STATL_CCPTRIG_LENGTH                0x00000001

#define _CCP3STATL_ICGARM_POSITION               0x0000000A
#define _CCP3STATL_ICGARM_MASK                   0x00000400
#define _CCP3STATL_ICGARM_LENGTH                 0x00000001

#define _CCP3STATL_TRIG_POSITION                 0x00000007
#define _CCP3STATL_TRIG_MASK                     0x00000080
#define _CCP3STATL_TRIG_LENGTH                   0x00000001

#define _CCP3STATH_RAWIP_POSITION                0x00000000
#define _CCP3STATH_RAWIP_MASK                    0x00000001
#define _CCP3STATH_RAWIP_LENGTH                  0x00000001

#define _CCP3STATH_RBWIP_POSITION                0x00000001
#define _CCP3STATH_RBWIP_MASK                    0x00000002
#define _CCP3STATH_RBWIP_LENGTH                  0x00000001

#define _CCP3STATH_TMRLWIP_POSITION              0x00000002
#define _CCP3STATH_TMRLWIP_MASK                  0x00000004
#define _CCP3STATH_TMRLWIP_LENGTH                0x00000001

#define _CCP3STATH_TMRHWIP_POSITION              0x00000003
#define _CCP3STATH_TMRHWIP_MASK                  0x00000008
#define _CCP3STATH_TMRHWIP_LENGTH                0x00000001

#define _CCP3STATH_PRLWIP_POSITION               0x00000004
#define _CCP3STATH_PRLWIP_MASK                   0x00000010
#define _CCP3STATH_PRLWIP_LENGTH                 0x00000001

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C2OUT_POSITION                   0x00000001
#define _CMSTAT_C2OUT_MASK                       0x00000002
#define _CMSTAT_C2OUT_LENGTH                     0x00000001

#define _CMSTAT_C3OUT_POSITION                   0x00000002
#define _CMSTAT_C3OUT_MASK                       0x00000004
#define _CMSTAT_C3OUT_LENGTH                     0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000008
#define _CMSTAT_C1EVT_MASK                       0x00000100
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_C2EVT_POSITION                   0x00000009
#define _CMSTAT_C2EVT_MASK                       0x00000200
#define _CMSTAT_C2EVT_LENGTH                     0x00000001

#define _CMSTAT_C3EVT_POSITION                   0x0000000A
#define _CMSTAT_C3EVT_MASK                       0x00000400
#define _CMSTAT_C3EVT_LENGTH                     0x00000001

#define _CMSTAT_CMIDL_POSITION                   0x0000000F
#define _CMSTAT_CMIDL_MASK                       0x00008000
#define _CMSTAT_CMIDL_LENGTH                     0x00000001

