MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA704/mcu.h
#define _ANSA_ANSELA3_POSITION                   0x00000003
#define _ANSA_ANSELA3_MASK                       0x00000008
#define _ANSA_ANSELA3_LENGTH                     0x00000001

#define _ANSELA_ANSA0_POSITION                   0x00000000
#define _ANSELA_ANSA0_MASK                       0x00000001
#define _ANSELA_ANSA0_LENGTH                     0x00000001

#define _ANSELA_ANSA1_POSITION                   0x00000001
#define _ANSELA_ANSA1_MASK                       0x00000002
#define _ANSELA_ANSA1_LENGTH                     0x00000001

#define _ANSELA_ANSA2_POSITION                   0x00000002
#define _ANSELA_ANSA2_MASK                       0x00000004
#define _ANSELA_ANSA2_LENGTH                     0x00000001

#define _ANSELA_ANSA3_POSITION                   0x00000003
#define _ANSELA_ANSA3_MASK                       0x00000008
#define _ANSELA_ANSA3_LENGTH                     0x00000001

#define _ANSELA_ANSELA0_POSITION                 0x00000000
#define _ANSELA_ANSELA0_MASK                     0x00000001
#define _ANSELA_ANSELA0_LENGTH                   0x00000001

#define _ANSELA_ANSELA1_POSITION                 0x00000001
#define _ANSELA_ANSELA1_MASK                     0x00000002
#define _ANSELA_ANSELA1_LENGTH                   0x00000001

#define _ANSELA_ANSELA2_POSITION                 0x00000002
#define _ANSELA_ANSELA2_MASK                     0x00000004
#define _ANSELA_ANSELA2_LENGTH                   0x00000001

#define _ANSELA_ANSELA3_POSITION                 0x00000003
#define _ANSELA_ANSELA3_MASK                     0x00000008
#define _ANSELA_ANSELA3_LENGTH                   0x00000001

#define _IOCPA_IOCPA0_POSITION                   0x00000000
#define _IOCPA_IOCPA0_MASK                       0x00000001
#define _IOCPA_IOCPA0_LENGTH                     0x00000001

#define _IOCPA_IOCPA1_POSITION                   0x00000001
#define _IOCPA_IOCPA1_MASK                       0x00000002
#define _IOCPA_IOCPA1_LENGTH                     0x00000001

#define _IOCPA_IOCPA2_POSITION                   0x00000002
#define _IOCPA_IOCPA2_MASK                       0x00000004
#define _IOCPA_IOCPA2_LENGTH                     0x00000001

#define _IOCPA_IOCPA3_POSITION                   0x00000003
#define _IOCPA_IOCPA3_MASK                       0x00000008
#define _IOCPA_IOCPA3_LENGTH                     0x00000001

#define _IOCPA_IOCPA4_POSITION                   0x00000004
#define _IOCPA_IOCPA4_MASK                       0x00000010
#define _IOCPA_IOCPA4_LENGTH                     0x00000001

#define _IOCPA_IOCPA7_POSITION                   0x00000007
#define _IOCPA_IOCPA7_MASK                       0x00000080
#define _IOCPA_IOCPA7_LENGTH                     0x00000001

#define _IOCPA_IOCPA8_POSITION                   0x00000008
#define _IOCPA_IOCPA8_MASK                       0x00000100
#define _IOCPA_IOCPA8_LENGTH                     0x00000001

#define _IOCPA_IOCPA9_POSITION                   0x00000009
#define _IOCPA_IOCPA9_MASK                       0x00000200
#define _IOCPA_IOCPA9_LENGTH                     0x00000001

#define _IOCPA_IOCPA10_POSITION                  0x0000000A
#define _IOCPA_IOCPA10_MASK                      0x00000400
#define _IOCPA_IOCPA10_LENGTH                    0x00000001

#define _IOCNA_IOCNA0_POSITION                   0x00000000
#define _IOCNA_IOCNA0_MASK                       0x00000001
#define _IOCNA_IOCNA0_LENGTH                     0x00000001

#define _IOCNA_IOCNA1_POSITION                   0x00000001
#define _IOCNA_IOCNA1_MASK                       0x00000002
#define _IOCNA_IOCNA1_LENGTH                     0x00000001

#define _IOCNA_IOCNA2_POSITION                   0x00000002
#define _IOCNA_IOCNA2_MASK                       0x00000004
#define _IOCNA_IOCNA2_LENGTH                     0x00000001

#define _IOCNA_IOCNA3_POSITION                   0x00000003
#define _IOCNA_IOCNA3_MASK                       0x00000008
#define _IOCNA_IOCNA3_LENGTH                     0x00000001

#define _IOCNA_IOCNA4_POSITION                   0x00000004
#define _IOCNA_IOCNA4_MASK                       0x00000010
#define _IOCNA_IOCNA4_LENGTH                     0x00000001

#define _IOCNA_IOCNA7_POSITION                   0x00000007
#define _IOCNA_IOCNA7_MASK                       0x00000080
#define _IOCNA_IOCNA7_LENGTH                     0x00000001

#define _IOCNA_IOCNA8_POSITION                   0x00000008
#define _IOCNA_IOCNA8_MASK                       0x00000100
#define _IOCNA_IOCNA8_LENGTH                     0x00000001

#define _IOCNA_IOCNA9_POSITION                   0x00000009
#define _IOCNA_IOCNA9_MASK                       0x00000200
#define _IOCNA_IOCNA9_LENGTH                     0x00000001

#define _IOCNA_IOCNA10_POSITION                  0x0000000A
#define _IOCNA_IOCNA10_MASK                      0x00000400
#define _IOCNA_IOCNA10_LENGTH                    0x00000001

#define _IOCFA_IOCFA0_POSITION                   0x00000000
#define _IOCFA_IOCFA0_MASK                       0x00000001
#define _IOCFA_IOCFA0_LENGTH                     0x00000001

#define _IOCFA_IOCFA1_POSITION                   0x00000001
#define _IOCFA_IOCFA1_MASK                       0x00000002
#define _IOCFA_IOCFA1_LENGTH                     0x00000001

#define _IOCFA_IOCFA2_POSITION                   0x00000002
#define _IOCFA_IOCFA2_MASK                       0x00000004
#define _IOCFA_IOCFA2_LENGTH                     0x00000001

#define _IOCFA_IOCFA3_POSITION                   0x00000003
#define _IOCFA_IOCFA3_MASK                       0x00000008
#define _IOCFA_IOCFA3_LENGTH                     0x00000001

#define _IOCFA_IOCFA4_POSITION                   0x00000004
#define _IOCFA_IOCFA4_MASK                       0x00000010
#define _IOCFA_IOCFA4_LENGTH                     0x00000001

#define _IOCFA_IOCFA7_POSITION                   0x00000007
#define _IOCFA_IOCFA7_MASK                       0x00000080
#define _IOCFA_IOCFA7_LENGTH                     0x00000001

#define _IOCFA_IOCFA8_POSITION                   0x00000008
#define _IOCFA_IOCFA8_MASK                       0x00000100
#define _IOCFA_IOCFA8_LENGTH                     0x00000001

#define _IOCFA_IOCFA9_POSITION                   0x00000009
#define _IOCFA_IOCFA9_MASK                       0x00000200
#define _IOCFA_IOCFA9_LENGTH                     0x00000001

