MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA704/mcu.h
#define _IOCPUA_IOCPUA2_POSITION                 0x00000002
#define _IOCPUA_IOCPUA2_MASK                     0x00000004
#define _IOCPUA_IOCPUA2_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA3_POSITION                 0x00000003
#define _IOCPUA_IOCPUA3_MASK                     0x00000008
#define _IOCPUA_IOCPUA3_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA4_POSITION                 0x00000004
#define _IOCPUA_IOCPUA4_MASK                     0x00000010
#define _IOCPUA_IOCPUA4_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA7_POSITION                 0x00000007
#define _IOCPUA_IOCPUA7_MASK                     0x00000080
#define _IOCPUA_IOCPUA7_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA8_POSITION                 0x00000008
#define _IOCPUA_IOCPUA8_MASK                     0x00000100
#define _IOCPUA_IOCPUA8_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA9_POSITION                 0x00000009
#define _IOCPUA_IOCPUA9_MASK                     0x00000200
#define _IOCPUA_IOCPUA9_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA10_POSITION                0x0000000A
#define _IOCPUA_IOCPUA10_MASK                    0x00000400
#define _IOCPUA_IOCPUA10_LENGTH                  0x00000001

#define _IOCPUA_CNPUA0_POSITION                  0x00000000
#define _IOCPUA_CNPUA0_MASK                      0x00000001
#define _IOCPUA_CNPUA0_LENGTH                    0x00000001

#define _IOCPUA_CNPUA1_POSITION                  0x00000001
#define _IOCPUA_CNPUA1_MASK                      0x00000002
#define _IOCPUA_CNPUA1_LENGTH                    0x00000001

#define _IOCPUA_CNPUA2_POSITION                  0x00000002
#define _IOCPUA_CNPUA2_MASK                      0x00000004
#define _IOCPUA_CNPUA2_LENGTH                    0x00000001

#define _IOCPUA_CNPUA3_POSITION                  0x00000003
#define _IOCPUA_CNPUA3_MASK                      0x00000008
#define _IOCPUA_CNPUA3_LENGTH                    0x00000001

#define _IOCPUA_CNPUA4_POSITION                  0x00000004
#define _IOCPUA_CNPUA4_MASK                      0x00000010
#define _IOCPUA_CNPUA4_LENGTH                    0x00000001

#define _IOCPUA_CNPUA7_POSITION                  0x00000007
#define _IOCPUA_CNPUA7_MASK                      0x00000080
#define _IOCPUA_CNPUA7_LENGTH                    0x00000001

#define _IOCPUA_CNPUA8_POSITION                  0x00000008
#define _IOCPUA_CNPUA8_MASK                      0x00000100
#define _IOCPUA_CNPUA8_LENGTH                    0x00000001

#define _IOCPUA_CNPUA9_POSITION                  0x00000009
#define _IOCPUA_CNPUA9_MASK                      0x00000200
#define _IOCPUA_CNPUA9_LENGTH                    0x00000001

#define _IOCPUA_CNPUA10_POSITION                 0x0000000A
#define _IOCPUA_CNPUA10_MASK                     0x00000400
#define _IOCPUA_CNPUA10_LENGTH                   0x00000001

#define _CNPDA_IOCPDA0_POSITION                  0x00000000
#define _CNPDA_IOCPDA0_MASK                      0x00000001
#define _CNPDA_IOCPDA0_LENGTH                    0x00000001

#define _CNPDA_IOCPDA1_POSITION                  0x00000001
#define _CNPDA_IOCPDA1_MASK                      0x00000002
#define _CNPDA_IOCPDA1_LENGTH                    0x00000001

#define _CNPDA_IOCPDA2_POSITION                  0x00000002
#define _CNPDA_IOCPDA2_MASK                      0x00000004
#define _CNPDA_IOCPDA2_LENGTH                    0x00000001

#define _CNPDA_IOCPDA3_POSITION                  0x00000003
#define _CNPDA_IOCPDA3_MASK                      0x00000008
#define _CNPDA_IOCPDA3_LENGTH                    0x00000001

#define _CNPDA_IOCPDA4_POSITION                  0x00000004
#define _CNPDA_IOCPDA4_MASK                      0x00000010
#define _CNPDA_IOCPDA4_LENGTH                    0x00000001

#define _CNPDA_IOCPDA7_POSITION                  0x00000007
#define _CNPDA_IOCPDA7_MASK                      0x00000080
#define _CNPDA_IOCPDA7_LENGTH                    0x00000001

#define _CNPDA_IOCPDA8_POSITION                  0x00000008
#define _CNPDA_IOCPDA8_MASK                      0x00000100
#define _CNPDA_IOCPDA8_LENGTH                    0x00000001

#define _CNPDA_IOCPDA9_POSITION                  0x00000009
#define _CNPDA_IOCPDA9_MASK                      0x00000200
#define _CNPDA_IOCPDA9_LENGTH                    0x00000001

#define _CNPDA_IOCPDA10_POSITION                 0x0000000A
#define _CNPDA_IOCPDA10_MASK                     0x00000400
#define _CNPDA_IOCPDA10_LENGTH                   0x00000001

#define _CNPDA_CNPDA0_POSITION                   0x00000000
#define _CNPDA_CNPDA0_MASK                       0x00000001
#define _CNPDA_CNPDA0_LENGTH                     0x00000001

#define _CNPDA_CNPDA1_POSITION                   0x00000001
#define _CNPDA_CNPDA1_MASK                       0x00000002
#define _CNPDA_CNPDA1_LENGTH                     0x00000001

#define _CNPDA_CNPDA2_POSITION                   0x00000002
#define _CNPDA_CNPDA2_MASK                       0x00000004
#define _CNPDA_CNPDA2_LENGTH                     0x00000001

#define _CNPDA_CNPDA3_POSITION                   0x00000003
#define _CNPDA_CNPDA3_MASK                       0x00000008
#define _CNPDA_CNPDA3_LENGTH                     0x00000001

#define _CNPDA_CNPDA4_POSITION                   0x00000004
#define _CNPDA_CNPDA4_MASK                       0x00000010
#define _CNPDA_CNPDA4_LENGTH                     0x00000001

#define _CNPDA_CNPDA7_POSITION                   0x00000007
#define _CNPDA_CNPDA7_MASK                       0x00000080
#define _CNPDA_CNPDA7_LENGTH                     0x00000001

#define _CNPDA_CNPDA8_POSITION                   0x00000008
#define _CNPDA_CNPDA8_MASK                       0x00000100
#define _CNPDA_CNPDA8_LENGTH                     0x00000001

#define _CNPDA_CNPDA9_POSITION                   0x00000009
#define _CNPDA_CNPDA9_MASK                       0x00000200
#define _CNPDA_CNPDA9_LENGTH                     0x00000001

#define _CNPDA_CNPDA10_POSITION                  0x0000000A
#define _CNPDA_CNPDA10_MASK                      0x00000400
#define _CNPDA_CNPDA10_LENGTH                    0x00000001

#define _IOCPDA_IOCPDA0_POSITION                 0x00000000
#define _IOCPDA_IOCPDA0_MASK                     0x00000001
#define _IOCPDA_IOCPDA0_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA1_POSITION                 0x00000001
#define _IOCPDA_IOCPDA1_MASK                     0x00000002
#define _IOCPDA_IOCPDA1_LENGTH                   0x00000001

