MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA704/mcu.h
#define _CNPDC_CNPDC6_POSITION                   0x00000006
#define _CNPDC_CNPDC6_MASK                       0x00000040
#define _CNPDC_CNPDC6_LENGTH                     0x00000001

#define _CNPDC_CNPDC7_POSITION                   0x00000007
#define _CNPDC_CNPDC7_MASK                       0x00000080
#define _CNPDC_CNPDC7_LENGTH                     0x00000001

#define _CNPDC_CNPDC8_POSITION                   0x00000008
#define _CNPDC_CNPDC8_MASK                       0x00000100
#define _CNPDC_CNPDC8_LENGTH                     0x00000001

#define _CNPDC_CNPDC9_POSITION                   0x00000009
#define _CNPDC_CNPDC9_MASK                       0x00000200
#define _CNPDC_CNPDC9_LENGTH                     0x00000001

#define _IOCPDC_IOCPDC0_POSITION                 0x00000000
#define _IOCPDC_IOCPDC0_MASK                     0x00000001
#define _IOCPDC_IOCPDC0_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC1_POSITION                 0x00000001
#define _IOCPDC_IOCPDC1_MASK                     0x00000002
#define _IOCPDC_IOCPDC1_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC2_POSITION                 0x00000002
#define _IOCPDC_IOCPDC2_MASK                     0x00000004
#define _IOCPDC_IOCPDC2_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC3_POSITION                 0x00000003
#define _IOCPDC_IOCPDC3_MASK                     0x00000008
#define _IOCPDC_IOCPDC3_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC4_POSITION                 0x00000004
#define _IOCPDC_IOCPDC4_MASK                     0x00000010
#define _IOCPDC_IOCPDC4_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC5_POSITION                 0x00000005
#define _IOCPDC_IOCPDC5_MASK                     0x00000020
#define _IOCPDC_IOCPDC5_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC6_POSITION                 0x00000006
#define _IOCPDC_IOCPDC6_MASK                     0x00000040
#define _IOCPDC_IOCPDC6_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC7_POSITION                 0x00000007
#define _IOCPDC_IOCPDC7_MASK                     0x00000080
#define _IOCPDC_IOCPDC7_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC8_POSITION                 0x00000008
#define _IOCPDC_IOCPDC8_MASK                     0x00000100
#define _IOCPDC_IOCPDC8_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC9_POSITION                 0x00000009
#define _IOCPDC_IOCPDC9_MASK                     0x00000200
#define _IOCPDC_IOCPDC9_LENGTH                   0x00000001

#define _IOCPDC_CNPDC0_POSITION                  0x00000000
#define _IOCPDC_CNPDC0_MASK                      0x00000001
#define _IOCPDC_CNPDC0_LENGTH                    0x00000001

#define _IOCPDC_CNPDC1_POSITION                  0x00000001
#define _IOCPDC_CNPDC1_MASK                      0x00000002
#define _IOCPDC_CNPDC1_LENGTH                    0x00000001

#define _IOCPDC_CNPDC2_POSITION                  0x00000002
#define _IOCPDC_CNPDC2_MASK                      0x00000004
#define _IOCPDC_CNPDC2_LENGTH                    0x00000001

#define _IOCPDC_CNPDC3_POSITION                  0x00000003
#define _IOCPDC_CNPDC3_MASK                      0x00000008
#define _IOCPDC_CNPDC3_LENGTH                    0x00000001

#define _IOCPDC_CNPDC4_POSITION                  0x00000004
#define _IOCPDC_CNPDC4_MASK                      0x00000010
#define _IOCPDC_CNPDC4_LENGTH                    0x00000001

#define _IOCPDC_CNPDC5_POSITION                  0x00000005
#define _IOCPDC_CNPDC5_MASK                      0x00000020
#define _IOCPDC_CNPDC5_LENGTH                    0x00000001

#define _IOCPDC_CNPDC6_POSITION                  0x00000006
#define _IOCPDC_CNPDC6_MASK                      0x00000040
#define _IOCPDC_CNPDC6_LENGTH                    0x00000001

#define _IOCPDC_CNPDC7_POSITION                  0x00000007
#define _IOCPDC_CNPDC7_MASK                      0x00000080
#define _IOCPDC_CNPDC7_LENGTH                    0x00000001

#define _IOCPDC_CNPDC8_POSITION                  0x00000008
#define _IOCPDC_CNPDC8_MASK                      0x00000100
#define _IOCPDC_CNPDC8_LENGTH                    0x00000001

#define _IOCPDC_CNPDC9_POSITION                  0x00000009
#define _IOCPDC_CNPDC9_MASK                      0x00000200
#define _IOCPDC_CNPDC9_LENGTH                    0x00000001

#define _AD1CON1_DONE_POSITION                   0x00000000
#define _AD1CON1_DONE_MASK                       0x00000001
#define _AD1CON1_DONE_LENGTH                     0x00000001

#define _AD1CON1_SAMP_POSITION                   0x00000001
#define _AD1CON1_SAMP_MASK                       0x00000002
#define _AD1CON1_SAMP_LENGTH                     0x00000001

#define _AD1CON1_ASAM_POSITION                   0x00000002
#define _AD1CON1_ASAM_MASK                       0x00000004
#define _AD1CON1_ASAM_LENGTH                     0x00000001

#define _AD1CON1_SSRC_POSITION                   0x00000004
#define _AD1CON1_SSRC_MASK                       0x000000F0
#define _AD1CON1_SSRC_LENGTH                     0x00000004

#define _AD1CON1_FORM_POSITION                   0x00000008
#define _AD1CON1_FORM_MASK                       0x00000300
#define _AD1CON1_FORM_LENGTH                     0x00000002

#define _AD1CON1_MODE12_POSITION                 0x0000000A
#define _AD1CON1_MODE12_MASK                     0x00000400
#define _AD1CON1_MODE12_LENGTH                   0x00000001

#define _AD1CON1_DMAEN_POSITION                  0x0000000B
#define _AD1CON1_DMAEN_MASK                      0x00000800
#define _AD1CON1_DMAEN_LENGTH                    0x00000001

#define _AD1CON1_DMABM_POSITION                  0x0000000C
#define _AD1CON1_DMABM_MASK                      0x00001000
#define _AD1CON1_DMABM_LENGTH                    0x00000001

#define _AD1CON1_ADSIDL_POSITION                 0x0000000D
#define _AD1CON1_ADSIDL_MASK                     0x00002000
#define _AD1CON1_ADSIDL_LENGTH                   0x00000001

#define _AD1CON1_ADON_POSITION                   0x0000000F
#define _AD1CON1_ADON_MASK                       0x00008000
#define _AD1CON1_ADON_LENGTH                     0x00000001

#define _AD1CON1_SSRC0_POSITION                  0x00000004
#define _AD1CON1_SSRC0_MASK                      0x00000010
#define _AD1CON1_SSRC0_LENGTH                    0x00000001

#define _AD1CON1_SSRC1_POSITION                  0x00000005
#define _AD1CON1_SSRC1_MASK                      0x00000020
#define _AD1CON1_SSRC1_LENGTH                    0x00000001

